app/Controllers/Admin.php

SELECT *
FROM `tbl_notifications`
SELECT COUNT(*) AS `numrows`
FROM `tbl_notifications`
WHERE `status` = 'pending'
---
    public function index()
    {
        // Load the necessary models
        $notificationModel = new NotificationModel();

        // Get all notifications
        $notifications = $notificationModel->findAll();

        // Count the number of pending notifications
        $notificationCount = $notificationModel->where('status','pending')->countAllResults();

SELECT *
FROM `tbl_products`
SELECT COUNT(*) AS `numrows`
FROM `tbl_notifications`
WHERE `status` = 'pending'
---
    public function viewProducts()
    {
        $model = new Products();
        $data['products'] = $model->findAll(); // Fetch all products from the model

        $notificationModel = new NotificationModel();
        $notificationCount = $notificationModel->where('status', 'pending')->countAllResults();