app/Controllers/BookingController.php

INSERT INTO `tbl_bookings` (`user_id`, `product_id`, `checkin_date`, `checkout_date`, `total_price`) VALUES ('10', '4', '2023-07-13', '2023-07-14', '33333')
---
    public function index($productID)
{
    // Get the user ID from the session or authentication library
    $session = session();
    $userId = $session->get('user_id'); // Adjust this according to your session setup

    // Retrieve the booking details from the form
    $checkInDate = $this->request->getPost('checkInDate');
    $checkOutDate = $this->request->getPost('checkOutDate');
    $totalPrice = $this->request->getPost('totalPrice');
    $productId = $this->request->getPost('productId'); // Get the product ID from the form

    // Create a new instance of the BookingModel
    $bookingModel = new BookingModel();

    // Prepare the data for insertion
    $data = [
        'user_id' => $userId,
        'product_id' => $productId,
        'checkin_date' => $checkInDate,
        'checkout_date' => $checkOutDate,
        'total_price' => $totalPrice,
    ];

    // Insert the booking data into the database
    $bookingModel->insert($data);