app/Controllers/Log.php

SELECT *
FROM `tbl_users`
WHERE `username` = 'georgevendor'
 LIMIT 1
SELECT *
FROM `tbl_vendor`
WHERE `email` = 'george.manya@strathmore.edu'
 LIMIT 1
---
    public function index()
    {
        $data = [];
        helper(['form']);

        $rules = [
            'username' => ['rules' => 'required|min_length[1]|max_length[255]'],
            'password' => ['rules' => 'required']
        ];

        if ($this->validate($rules)) {
            $model = new Users();
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            // Check if the user exists in the database
            $user = $model->where('username', $username)->first();

            if ($user) {
                // Verify the password
                if (password_verify($password, $user['password'])) {
                    // Check if the user is active
                    if (isset($user['is_active']) && $user['is_active'] == 1) {
                        // New conditions
                        $role = $user['role'];

                        if ($role == 1) {
                            // Fetch vendor status from Vendors table
                            $vendorModel = new VendorModel();
                            $vendor = $vendorModel->where('email', $user['email'])->first();

SELECT *
FROM `tbl_products`
---
                            $data['username'] = $user['username'];

                            $productModel = new Products();
                             $data['products'] = $productModel->findAll();