app/Controllers/Post.php

            'available_date' => $availableDate,
            'additional_info' => $additionalInfo
        ];
        $model->insert($productData);
---
INSERT INTO `tbl_products` (`product_name`, `product_description`, `product_images`, `price`, `location`, `available_date`) VALUES ('name', 'namessssss', '', '9900', 'ss', '2023-07-18')