app/Controllers/ProductController.php

SELECT *
FROM `tbl_products`
WHERE `tbl_products`.`id` = '3'
---
    public function show($id)
    {
        $model = new Products();
        $product = $model->find($id);