app/Controllers/VendorController.php

        public function bookinghistory()
        {
            // Get the user ID from the session or authentication library
            $session = session();
            $userId = $session->get('user_id'); // Adjust this according to your session setup

            // Create a new instance of the BookingModel
            $bookingModel = new BookingModel();

            // Retrieve the user's booking history from the database
            $bookings = $bookingModel->where('vendor_id', $userId)->findAll();
---
SELECT *
FROM `tbl_bookings`
WHERE `vendor_id` = '17'